---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.AnalyticalOpening
source: html/bbcbb6e1-820d-6cc1-fb89-24d8eb6f6df5.htm
---
# AnalyticalOpening Properties

This represents the Analyze As parameter assigned to Analytical Element.